import React from 'react'

const AboutComponent = () => {
  return (
    <div>
    <div className="bg-white p-8 rounded-lg shadow-md w-full max-w-md">
  <h1 className="text-3xl font-bold mb-6">تذكير النفس</h1>
  <p className="text-gray-700 mb-4">إصدار التطبيق: 1.0.0</p>
  <p className="text-gray-700 mb-4">محتوى التطبيق: تطبيق لإضافة الأذكار وتحديد عدد التكرار</p>
  <p className="text-gray-700 mb-4">المطورون: عربي مجهول الهوية</p>
  <p className="text-gray-700 mb-4">مكان المطور: الجزائر</p>
  <p className="text-gray-700 mb-4">لغة البرمجة: JavaScript</p>
  <p className="text-gray-700 mb-4">يحتاج الاتصال بالإنترنت: لا</p>
  <p className="text-gray-700 mb-4">البيانات تختفي بعد الخروج: نعم</p>
  <div className="mt-8">
    <p className="text-gray-700 mb-4">مرحبًا بك في تطبيق "تذكير النفس"، الذي يتيح لك إضافة الأذكار وتحديد عدد مرات التكرار. تأكد من البقاء مرتبطًا بتقنيات الذكاء الروحي مع هذا التطبيق!</p>
    <p className="text-gray-700 mb-4">    
    
    بسم الله الرحمن الرحيم

الحمد لله الذي بنعمته تتمّ الصالحات، والصلاة والسلام على رسول الله محمد صلى الله عليه وسلم، وعلى آله وصحبه أجمعين.

أما بعد:

فإننا نعيش في عالم مليء بالضغوط والتحديات، وفي ظل هذه الظروف، يكون اللجوء إلى الله سبحانه وتعالى هو الطريق الأمثل للسلوى والتوجيه. لذا، أود أن أذكّرنا جميعًا بأهمية ترسيخ الذكر في حياتنا اليومية.

قال الله تعالى في كتابه الكريم: "أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ" (الرعد: 28).

إن الذكر لله تعالى هو وسيلة قوية لتهدئة القلوب والعقول، وتحقيق الراحة الداخلية. إنه يعزز الروحانية ويقوي الإرادة، ويوجهنا نحو الخير والبر. لذا، دعونا نجعل الذكر عادة يومية في حياتنا.

 الصباح والمساء:
   ابدأوا يومكم بذكر الله، واختموه بالاستغفار والدعاء في المساء. استغلوا هذه اللحظات لتوجيه شكركم لله على نعمه والاستغفار من ذنوبكم.

الصلوات الخمس:
   قوموا بأداء الصلوات الخمس في أوقاتها المحددة. إنها فرصة للتواصل المباشر مع الله ولتجديد العهد والاستماع إلى كلماته الطيبة.

 قراءة القرآن:
   اجعلوا عادة يومية قراءة آيات من القرآن الكريم. هذا ليس فقط تلاوة، بل تأملوا في معانيها وحاولوا تطبيقها في حياتكم اليومية.

الذكر في الأعمال اليومية:
   ضعوا عبارات الذكر في حياتكم اليومية، سواء كان ذلك أثناء العمل، أو السفر، أو حتى في لحظات الفرح والسرور.

الدعاء:
   لا تترددوا في الدعاء وطلب الخير من الله. اعلموا أنه سبحانه وتعالى يستجيب لدعاء العبد المؤمن.

أخي الحبيب، أختي الغالية، إن الله سبحانه وتعالى يحب أن نكون قريبين منه وأن نتذكره باستمرار. لا تترددوا في مشاركة هذه العادات الدينية مع من حولكم، فقد تكونون قدوة للآخرين في سعيهم نحو الله.

أسأل الله أن يجعل الذكر والعبادة سببًا لقربنا منه ولزيادة السكينة في قلوبنا. وصلى الله على نبينا محمد وعلى آله وصحبه أجمعين.

والله الموفق والهادي إلى سواء السبيل.    
    </p>

  </div>
</div>

    </div>
  )
}

export default AboutComponent